; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?arm - arm ?crate - crate)
    (empty-arm ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?arm ?crate)     
        (not (empty-arm ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l25_p25_c25_g25_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(crate-at crate25 depot)
	(empty-arm left)
	(empty-arm right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate food crate16)
	(content-crate food crate17)
	(content-crate food crate18)
	(content-crate food crate19)
	(content-crate food crate20)
	(content-crate food crate21)
	(content-crate food crate22)
	(content-crate food crate23)
	(content-crate food crate24)
	(content-crate medicine crate25)
	(person-at person1 loc15)
	(person-at person2 loc1)
	(person-at person3 loc6)
	(person-at person4 loc11)
	(person-at person5 loc15)
	(person-at person6 loc1)
	(person-at person7 loc25)
	(person-at person8 loc15)
	(person-at person9 loc23)
	(person-at person10 loc19)
	(person-at person11 loc5)
	(person-at person12 loc23)
	(person-at person13 loc3)
	(person-at person14 loc8)
	(person-at person15 loc13)
	(person-at person16 loc20)
	(person-at person17 loc3)
	(person-at person18 loc15)
	(person-at person19 loc25)
	(person-at person20 loc25)
	(person-at person21 loc8)
	(person-at person22 loc8)
	(person-at person23 loc11)
	(person-at person24 loc5)
	(person-at person25 loc4)
	(person-need person1 food)
	(person-need person2 food)
	(person-need person3 food)
	(person-need person5 food)
	(person-need person6 food)
	(person-need person7 food)
	(person-need person8 food)
	(person-need person9 food)
	(person-need person10 food)
	(person-need person11 food)
	(person-need person12 food)
	(person-need person13 food)
	(person-need person14 food)
	(person-need person15 food)
	(person-need person16 food)
	(person-need person17 food)
	(person-need person18 food)
	(person-need person19 food)
	(person-need person20 food)
	(person-need person21 food)
	(person-need person22 food)
	(person-need person23 food)
	(person-need person24 food)
	(person-need person24 medicine)
	(person-need person25 food)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 food)
	(has-content-person person3 food)
	(has-content-person person5 food)
	(has-content-person person6 food)
	(has-content-person person7 food)
	(has-content-person person8 food)
	(has-content-person person9 food)
	(has-content-person person10 food)
	(has-content-person person11 food)
	(has-content-person person12 food)
	(has-content-person person13 food)
	(has-content-person person14 food)
	(has-content-person person15 food)
	(has-content-person person16 food)
	(has-content-person person17 food)
	(has-content-person person18 food)
	(has-content-person person19 food)
	(has-content-person person20 food)
	(has-content-person person21 food)
	(has-content-person person22 food)
	(has-content-person person23 food)
	(has-content-person person24 food)
	(has-content-person person24 medicine)
	(has-content-person person25 food)
))
)

; plan
1. (pick-up-crate crate25 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate25 depot)
   added: (has-crate-drone-arm right crate25)
   goals met: 1 of 26
2. (pick-up-crate crate24 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate24 depot)
   added: (has-crate-drone-arm left crate24)
   goals met: 1 of 26
3. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 0 of 26
4. (drop-crate loc5 person24 crate25 right medicine drone1)
   deleted: (has-crate-drone-arm right crate25)
   added: (has-content-person person24 medicine) (empty-arm right)
   goals met: 1 of 26
5. (drop-crate loc5 person11 crate24 left food drone1)
   deleted: (has-crate-drone-arm left crate24)
   added: (has-content-person person11 food) (empty-arm left)
   goals met: 2 of 26
6. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 3 of 26
7. (pick-up-crate crate23 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate23 depot)
   added: (has-crate-drone-arm right crate23)
   goals met: 3 of 26
8. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 2 of 26
9. (drop-crate loc20 person16 crate23 right food drone1)
   deleted: (has-crate-drone-arm right crate23)
   added: (has-content-person person16 food) (empty-arm right)
   goals met: 3 of 26
10. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 4 of 26
11. (pick-up-crate crate22 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate22 depot)
   added: (has-crate-drone-arm right crate22)
   goals met: 4 of 26
12. (drone-move depot loc19 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc19)
   goals met: 3 of 26
13. (drop-crate loc19 person10 crate22 right food drone1)
   deleted: (has-crate-drone-arm right crate22)
   added: (has-content-person person10 food) (empty-arm right)
   goals met: 4 of 26
14. (drone-move loc19 depot drone1)
   deleted: (drone-at drone1 loc19)
   added: (drone-at drone1 depot)
   goals met: 5 of 26
15. (pick-up-crate crate21 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate21 depot)
   added: (has-crate-drone-arm right crate21)
   goals met: 5 of 26
16. (drone-move depot loc13 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc13)
   goals met: 4 of 26
17. (drop-crate loc13 person15 crate21 right food drone1)
   deleted: (has-crate-drone-arm right crate21)
   added: (has-content-person person15 food) (empty-arm right)
   goals met: 5 of 26
18. (drone-move loc13 depot drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 depot)
   goals met: 6 of 26
19. (pick-up-crate crate20 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate20 depot)
   added: (has-crate-drone-arm right crate20)
   goals met: 6 of 26
20. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 5 of 26
21. (drop-crate loc11 person23 crate20 right food drone1)
   deleted: (has-crate-drone-arm right crate20)
   added: (has-content-person person23 food) (empty-arm right)
   goals met: 6 of 26
22. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 7 of 26
23. (pick-up-crate crate19 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate19 depot)
   added: (has-crate-drone-arm right crate19)
   goals met: 7 of 26
24. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 6 of 26
25. (drop-crate loc6 person3 crate19 right food drone1)
   deleted: (has-crate-drone-arm right crate19)
   added: (has-content-person person3 food) (empty-arm right)
   goals met: 7 of 26
26. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 8 of 26
27. (pick-up-crate crate18 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate18 depot)
   added: (has-crate-drone-arm right crate18)
   goals met: 8 of 26
28. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 7 of 26
29. (drop-crate loc5 person24 crate18 right food drone1)
   deleted: (has-crate-drone-arm right crate18)
   added: (has-content-person person24 food) (empty-arm right)
   goals met: 8 of 26
30. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 9 of 26
31. (pick-up-crate crate17 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate17 depot)
   added: (has-crate-drone-arm right crate17)
   goals met: 9 of 26
32. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 8 of 26
33. (drop-crate loc4 person25 crate17 right food drone1)
   deleted: (has-crate-drone-arm right crate17)
   added: (has-content-person person25 food) (empty-arm right)
   goals met: 9 of 26
34. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 10 of 26
35. (pick-up-crate crate16 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate16 depot)
   added: (has-crate-drone-arm right crate16)
   goals met: 10 of 26
36. (pick-up-crate crate15 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate15 depot)
   added: (has-crate-drone-arm left crate15)
   goals met: 10 of 26
37. (drone-move depot loc25 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc25)
   goals met: 9 of 26
38. (drop-crate loc25 person7 crate15 left food drone1)
   deleted: (has-crate-drone-arm left crate15)
   added: (has-content-person person7 food) (empty-arm left)
   goals met: 10 of 26
39. (drop-crate loc25 person19 crate16 right food drone1)
   deleted: (has-crate-drone-arm right crate16)
   added: (has-content-person person19 food) (empty-arm right)
   goals met: 11 of 26
40. (drone-move loc25 depot drone1)
   deleted: (drone-at drone1 loc25)
   added: (drone-at drone1 depot)
   goals met: 12 of 26
41. (pick-up-crate crate14 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate14 depot)
   added: (has-crate-drone-arm right crate14)
   goals met: 12 of 26
42. (drone-move depot loc25 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc25)
   goals met: 11 of 26
43. (drop-crate loc25 person20 crate14 right food drone1)
   deleted: (has-crate-drone-arm right crate14)
   added: (has-content-person person20 food) (empty-arm right)
   goals met: 12 of 26
44. (drone-move loc25 depot drone1)
   deleted: (drone-at drone1 loc25)
   added: (drone-at drone1 depot)
   goals met: 13 of 26
45. (pick-up-crate crate13 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate13 depot)
   added: (has-crate-drone-arm right crate13)
   goals met: 13 of 26
46. (pick-up-crate crate12 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate12 depot)
   added: (has-crate-drone-arm left crate12)
   goals met: 13 of 26
47. (drone-move depot loc23 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc23)
   goals met: 12 of 26
48. (drop-crate loc23 person9 crate12 left food drone1)
   deleted: (has-crate-drone-arm left crate12)
   added: (has-content-person person9 food) (empty-arm left)
   goals met: 13 of 26
49. (drop-crate loc23 person12 crate13 right food drone1)
   deleted: (has-crate-drone-arm right crate13)
   added: (has-content-person person12 food) (empty-arm right)
   goals met: 14 of 26
50. (drone-move loc23 depot drone1)
   deleted: (drone-at drone1 loc23)
   added: (drone-at drone1 depot)
   goals met: 15 of 26
51. (pick-up-crate crate11 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate11 depot)
   added: (has-crate-drone-arm right crate11)
   goals met: 15 of 26
52. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate10 depot)
   added: (has-crate-drone-arm left crate10)
   goals met: 15 of 26
53. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 14 of 26
54. (drop-crate loc15 person1 crate10 left food drone1)
   deleted: (has-crate-drone-arm left crate10)
   added: (has-content-person person1 food) (empty-arm left)
   goals met: 15 of 26
55. (drop-crate loc15 person5 crate11 right food drone1)
   deleted: (has-crate-drone-arm right crate11)
   added: (has-content-person person5 food) (empty-arm right)
   goals met: 16 of 26
56. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 17 of 26
57. (pick-up-crate crate9 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate9 depot)
   added: (has-crate-drone-arm right crate9)
   goals met: 17 of 26
58. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate8 depot)
   added: (has-crate-drone-arm left crate8)
   goals met: 17 of 26
59. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 16 of 26
60. (drop-crate loc15 person8 crate8 left food drone1)
   deleted: (has-crate-drone-arm left crate8)
   added: (has-content-person person8 food) (empty-arm left)
   goals met: 17 of 26
61. (drop-crate loc15 person18 crate9 right food drone1)
   deleted: (has-crate-drone-arm right crate9)
   added: (has-content-person person18 food) (empty-arm right)
   goals met: 18 of 26
62. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 19 of 26
63. (pick-up-crate crate7 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate7 depot)
   added: (has-crate-drone-arm right crate7)
   goals met: 19 of 26
64. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate6 depot)
   added: (has-crate-drone-arm left crate6)
   goals met: 19 of 26
65. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 18 of 26
66. (drop-crate loc8 person14 crate6 left food drone1)
   deleted: (has-crate-drone-arm left crate6)
   added: (has-content-person person14 food) (empty-arm left)
   goals met: 19 of 26
67. (drop-crate loc8 person21 crate7 right food drone1)
   deleted: (has-crate-drone-arm right crate7)
   added: (has-content-person person21 food) (empty-arm right)
   goals met: 20 of 26
68. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 21 of 26
69. (pick-up-crate crate5 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate5 depot)
   added: (has-crate-drone-arm right crate5)
   goals met: 21 of 26
70. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 20 of 26
71. (drop-crate loc8 person22 crate5 right food drone1)
   deleted: (has-crate-drone-arm right crate5)
   added: (has-content-person person22 food) (empty-arm right)
   goals met: 21 of 26
72. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 22 of 26
73. (pick-up-crate crate4 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate4 depot)
   added: (has-crate-drone-arm right crate4)
   goals met: 22 of 26
74. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate3 depot)
   added: (has-crate-drone-arm left crate3)
   goals met: 22 of 26
75. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 21 of 26
76. (drop-crate loc3 person13 crate3 left food drone1)
   deleted: (has-crate-drone-arm left crate3)
   added: (has-content-person person13 food) (empty-arm left)
   goals met: 22 of 26
77. (drop-crate loc3 person17 crate4 right food drone1)
   deleted: (has-crate-drone-arm right crate4)
   added: (has-content-person person17 food) (empty-arm right)
   goals met: 23 of 26
78. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 24 of 26
79. (pick-up-crate crate2 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate2 depot)
   added: (has-crate-drone-arm right crate2)
   goals met: 24 of 26
80. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate1 depot)
   added: (has-crate-drone-arm left crate1)
   goals met: 24 of 26
81. (drone-move depot loc1 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc1)
   goals met: 23 of 26
82. (drop-crate loc1 person2 crate1 left food drone1)
   deleted: (has-crate-drone-arm left crate1)
   added: (has-content-person person2 food) (empty-arm left)
   goals met: 24 of 26
83. (drop-crate loc1 person6 crate2 right food drone1)
   deleted: (has-crate-drone-arm right crate2)
   added: (has-content-person person6 food) (empty-arm right)
   goals met: 25 of 26
84. (drone-move loc1 depot drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 depot)
   goals met: 26 of 26
